n = int(input("Введите номер месяца: "))
print("#Решение через list")
season_list = ['зима', 'зима', 'весна', 'весна', 'весна', 'лето', 'лето', 'лето', 'осень', 'осень', 'осень', 'зима']
if 0 < n < 13:
    print(season_list[n-1])
else:
    print("Нет такого месяца")    

print("#Решение через dict")
season_dict = {1: 'зима', 2: 'зима', 3: 'весна', 4: 'весна', 5: 'весна', 6: 'лето', 7: 'лето', 8: 'лето', 9: 'осень', 10: 'осень', 11: 'осень', 12: 'зима'}
print(season_dict.get(n,"Нет такого месяца"))
